Schwabano/IMXRT1064-EVK-BuildEnvironment/PlatformPackage/RGB888/ewextgfx.c
    /* check if the surface is used by pending hardware accelerator operations */
    if (( surface->Flags & EW_SURFACE_TRANSACTION_MASK ) == TransactionNumber )
    {
      /* wait until hardware accelerated drawing operation is finished */
      GfxFlushGraphics();
    }

    /* check if the given surface was previously modified by hardware graphics accelerator */
    if ( surface->Flags & EW_SURFACE_MODIFIED_BY_GA )
    {
      /* invalidate the cache for the address range of the pixel data */
      EW_INVALIDATE_CACHE( surface->Pixel, surface->Width * surface->Height * surface->BytesPerPixel );

      /* clear the flag */
      surface->Flags &= ~EW_SURFACE_MODIFIED_BY_GA;
    }

  #endif

  /* sign the surface as modified by CPU */
  if ( aWritePixel )
    surface->Flags |= EW_SURFACE_MODIFIED_BY_CPU;

  EwZero( aMemory, sizeof( XSurfaceMemory ));

  /* return the details of the surface */
  aMemory->Pixel1  = (unsigned char*)surface->Pixel + (( aY * surface->Width ) + aX ) * surface->BytesPerPixel;
  aMemory->Pitch1Y = surface->Width * surface->BytesPerPixel;
  aMemory->Pitch1X = surface->BytesPerPixel;

  #ifdef EW_USE_READER_FOR_CONST_SURFACES

    /* if the constant surface is not accessible by the CPU, a reader has to be
       used in order to load and map the pixel pointers */
    if ( surface->Flags & EW_SURFACE_PREALLOCATED )
      aMemory->Reader = EwFlashAreaReaderProc;

  #endif

  return (void*)1;
}


/*******************************************************************************
* FUNCTION:
*   GfxUnlockSurface
*
* DESCRIPTION:
*   The function GfxUnlockSurface() has the job to unlock the given surface and
*   if necessary free any temporary used resources.
*   This function is a counterpart to GfxLockSurface().
*
* ARGUMENTS:
*   aSurfaceHandle - Handle to the surface to release the direct memory access.
*   aLockHandle    - value returned by the corresponding LockSurface() call.
*     If LockSurface() has allocated memory for the lock object, you will need
*     to free it now.
*   aX, aY,
*   aWidth,
*   aHeight     - Area within the surface affected by the access operation.
*     (Relative to the top-left corner of the surface). This is the area, the
*     caller wished to read/write the pixel data.
*   aIndex,
*   Count       - Optional start index and number of entries within the CLUT,
*     the caller wished to read/write. These paramaters are used for surfaces
*     with the index8 color format only.
*   aWritePixel - Is != 0, if the caller has modified the pixel information
*     within the surface memory. If == 0, no modification took place, so no
*     surface updates are needed.
*   aWriteClut  - Is != 0, if the caller has modified the CLUT information.
*     If == 0, no modification took place, so no surface updates are needed.
*
* RETURN VALUE:
*   None
*
*******************************************************************************/
void GfxUnlockSurface( void* aSurfaceHandle, void* aLockHandle,
  int aX, int aY, int aWidth, int aHeight, int aIndex, int aCount, int aWritePixel,
  int aWriteClut )
{
  EW_UNUSED_ARG( aSurfaceHandle );
  EW_UNUSED_ARG( aLockHandle );
  EW_UNUSED_ARG( aX );
  EW_UNUSED_ARG( aY );
  EW_UNUSED_ARG( aWidth );
  EW_UNUSED_ARG( aHeight );
  EW_UNUSED_ARG( aIndex );
  EW_UNUSED_ARG( aCount );
  EW_UNUSED_ARG( aWritePixel );
  EW_UNUSED_ARG( aWriteClut );

  /* log the operation */
  #if EW_PRINT_GFX_TASK_DETAILS
    EwPrint( "GfxUnlockSurface( 0x%p, ( %d, %d, %d, %d ), %d, %d, %d, %d )\n",
      aSurfaceHandle, aX, aY, aWidth, aHeight, aIndex, aCount, aWritePixel, aWriteClut );
  #endif
}


#ifdef EW_USE_GRAPHICS_ACCELERATOR

/* helper function to finalize any hardware accelerated drawing operation */
static void GfxFlushGraphics( void )
{
  /* log the operation */
  #if EW_PRINT_GFX_TASK_DETAILS
    EwPrint( "GfxFlushGraphics()\n" );
  #endif

  /* wait until hardware accelerated drawing operation is finished */
  EwBspGraphicsWaitForCompletion();
}


/* helper function to prepare access to surfaces by hardware */
static void GfxSelectSurfaces( void* aDstSurfaceHandle, void* aSrcSurfaceHandle )
{
  XGfxSurface* dstSurface = (XGfxSurface*)aDstSurfaceHandle;
  XGfxSurface* srcSurface = (XGfxSurface*)aSrcSurfaceHandle;

  /* GA ist started for every instruction separately, increment number for further signing of surfaces */
  TransactionNumber++;

  if ( dstSurface )
  {
    /* check if the given surface was previously modified by CPU */
    if ( dstSurface->Flags & EW_SURFACE_MODIFIED_BY_CPU )
    {
      /* writeback the cache for the address range of the pixel data */
      EW_CLEAN_CACHE( dstSurface->Pixel, dstSurface->Width * dstSurface->Height * dstSurface->BytesPerPixel );

      /* clear the flag */
      dstSurface->Flags &= ~EW_SURFACE_MODIFIED_BY_CPU;
    }

    /* sign the surface now as modified by hardware graphics accelerator */
    dstSurface->Flags |= EW_SURFACE_MODIFIED_BY_GA;

    /* store the current transaction number */
    dstSurface->Flags &= ~EW_SURFACE_TRANSACTION_MASK;
    dstSurface->Flags |= ( TransactionNumber & EW_SURFACE_TRANSACTION_MASK );
  }

  if ( srcSurface )
  {
    /* check if the given surface was previously modified by CPU */
    if ( srcSurface->Flags & EW_SURFACE_MODIFIED_BY_CPU )
    {
      /* writeback the cache for the address range of the pixel data */
      EW_CLEAN_CACHE( srcSurface->Pixel, srcSurface->Width * srcSurface->Height * srcSurface->BytesPerPixel );

      /* clear the flag */
      srcSurface->Flags &= ~EW_SURFACE_MODIFIED_BY_CPU;
    }

    /* store the current transaction number */
    srcSurface->Flags &= ~EW_SURFACE_TRANSACTION_MASK;
    srcSurface->Flags |= ( TransactionNumber & EW_SURFACE_TRANSACTION_MASK );
  }
}


/*******************************************************************************
* FUNCTION:
*   GfxFillDriver
*
* DESCRIPTION:
*   The function GfxFillDriver is called from the Graphics Engine, when a
*   rectangular area should be filled by using the graphics hardware.
*
* ARGUMENTS:
*   aDstHandle  - Handle to the destination surface (native/screen color format).
*      See the function CreateSurface().
*   aDstX,
*   aDstY       - Origin of the area to fill (relative to the top-left corner
*      of the destination surface).
*   aWidth,
*   aHeight     - Size of the area to fill.
*   aBlend      - != 0 if the operation should be performed with alpha blending.
*   aColors     - Array with 4 RGBA8888 color values. The four color values do
*     correspond to the four corners of the area: top-left, top-right, bottom-
*     right and bottom-left.
*
* RETURN VALUE:
*   None
*
*******************************************************************************/
void GfxFillDriver( void* aDstHandle, int aDstX, int aDstY,
  int aWidth, int aHeight, int aBlend, unsigned long* aColors )
{
  XGfxSurface* dstSurface = (XGfxSurface*)aDstHandle;
  void*        dst;
  int          dstPitch;

  /* log the operation */
  #if EW_PRINT_GFX_TASK_DETAILS
    EwPrint( "GfxFillDriver( 0x%p, ( %d, %d, %d, %d ), %d, [ #%08X, #%08X, #%08X, #%08X ])\n",
      aDstHandle, aDstX, aDstY, aWidth, aHeight, aBlend,
      aColors[0], aColors[1], aColors[2], aColors[3]);
  #endif

#ifndef EW_DONT_USE_GFX_EMULATION

  /* make a software emulation of the drawing function */
  if ( UseGraphicsAccelerator == 0 )
  {
    XSurfaceMemory dstMem;
    XGradient      gradient;
    XFillWorker    worker = EwScreenFillRowSolid;

    /* prepare access to the destination buffer */
    GfxLockSurface( aDstHandle, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, &dstMem );

    /* let the Graphics Engine make the drawing operation */
    EwInitColorGradient( aWidth, aHeight, (unsigned int*)aColors, &gradient );
    EwEmulateFill( &dstMem, aDstX, aDstY, aWidth, aHeight, &gradient, aWidth, aHeight, worker );

    /* unlock destination buffer */
    GfxUnlockSurface( aDstHandle, 0, 0, 0, 0, 0, 0, 0, 1, 0 );
  }

  /* otherwise use the hardware... */
  else

#endif
  {
    uint32_t dstColorFormat = kPXP_OutputPixelFormatRGB888P;
    uint32_t color = ( EW_ALPHA( aColors[0]) << 24 )
                   | ( EW_RED  ( aColors[0]) << 16 )
                   | ( EW_GREEN( aColors[0]) <<  8 )
                   |   EW_BLUE ( aColors[0]);

    /* prepare access to the destination buffer */
    GfxSelectSurfaces( aDstHandle, 0 );

    /* get the start address in the destination and the offset */
    dst      = (void*)((unsigned char*)dstSurface->Pixel + (( aDstY * dstSurface->Width ) + aDstX ) * dstSurface->BytesPerPixel );
    dstPitch = dstSurface->Width * dstSurface->BytesPerPixel;

    /* choose the appropriate PXP drawing operation */
    EwBspGraphicsFill( (uint32_t)dst, dstPitch, aWidth, aHeight, dstColorFormat, color );
  }
}


