Schwabano/IMXRT1064-EVK-BuildEnvironment/PlatformPackage/RGB888/ewextgfx.c
/*******************************************************************************
* FUNCTION:
*   GfxCopyDriver
*
* DESCRIPTION:
*   The function GfxCopyDriver is called from the Graphics Engine, when a
*   rectangular bitmap area should be copied by using the graphics hardware.
*
* ARGUMENTS:
*   aDstHandle  - Handle to the destination surface (native/screen color format).
*      See the function CreateSurface().
*   aSrcHandle  - Handle to the source surface (native/index8/alpha8/rgb565 color
*      format). See the function CreateSurface().
*   aDstX,
*   aDstY       - Origin of the area to fill with the copied source surface
*     pixel (relative to the top-left corner of the destination surface).
*   aWidth,
*   aHeight     - Size of the area to fill with the copied source surface pixel.
*   aSrcX,
*   aSrcY       - Origin of the area to copy from the source surface.
*   aBlend      - != 0 if the operation should be performed with alpha blending.
*   aColors     - Array with 4 color values. These four values do correspond
*     to the four corners of the area: top-left, top-right, bottom-right and
*     bottom-left.
*     In case of an alpha8 source surface if all colors are equal, the solid
*     variant of the operation is assumed.
*     In case of native and index8 source surfaces if all colors are equal but
*     their alpha value < 255, the solid variant of the operation is assumed.
*     In case of native and index8 source surfaces if all colors are equal and
*     their alpha value == 255, the variant without any modulation is assumed.
*
* RETURN VALUE:
*   None
*
*******************************************************************************/
void GfxCopyDriver( void* aDstHandle, void* aSrcHandle,
  int aDstX, int aDstY, int aSrcX, int aSrcY, int aWidth, int aHeight,
  int aBlend, unsigned long* aColors )
{
  XGfxSurface* dstSurface = (XGfxSurface*)aDstHandle;
  XGfxSurface* srcSurface = (XGfxSurface*)aSrcHandle;
  void*        dst;
  int          dstPitch;
  void*        src;
  int          srcPitch;
  int          dstFormat = dstSurface->Format;
  int          srcFormat = srcSurface->Format;

  /* log the operation */
  #if EW_PRINT_GFX_TASK_DETAILS
    EwPrint( "GfxCopyDriver( 0x%p, 0x%p, ( %d, %d ), ( %d, %d ), ( %d, %d ), %d, "
      "[ #%08X, #%08X, #%08X, #%08X ])\n", aDstHandle, aSrcHandle, aDstX, aDstY,
      aSrcX, aSrcY, aWidth, aHeight, aBlend, aColors[0], aColors[1], aColors[2], aColors[3]);
  #endif

#ifndef EW_DONT_USE_GFX_EMULATION

  /* make a software emulation of the drawing function */
  if ( UseGraphicsAccelerator == 0 )
  {
    XSurfaceMemory dstMem;
    XSurfaceMemory srcMem;
    unsigned char  alpha  = EW_ALPHA( aColors[0]);
    XGradient      gradient;
    XCopyWorker    worker = 0;

    /* prepare access to the destination and source buffer */
    GfxLockSurface( aDstHandle, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, &dstMem );
    GfxLockSurface( aSrcHandle, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, &srcMem );

    /* select the necessary drawing function */
    if ( srcFormat == EW_PIXEL_FORMAT_NATIVE )
    {
      if ( dstFormat == EW_PIXEL_FORMAT_SCREEN )
        worker = (alpha == 0xFF) ? EwScreenCopyNativeRow : EwScreenCopyNativeRowSolid;
      else
        worker = EwCopyNativeRow;
    }
    else if ( srcFormat == EW_PIXEL_FORMAT_RGB565 )
    {
      if ( dstFormat == EW_PIXEL_FORMAT_SCREEN )
        worker = (alpha == 0xFF) ? EwScreenCopyRGB565Row : EwScreenCopyRGB565RowSolid;
      else
        worker = EwCopyRGB565Row;
    }

    /* let the Graphics Engine make the drawing operation */
    EwInitColorGradient( aWidth, aHeight, (unsigned int*)aColors, &gradient );
    EwEmulateCopy( &dstMem, &srcMem, aDstX, aDstY, aWidth, aHeight, aSrcX, aSrcY, &gradient, aWidth, aHeight, worker );

    /* unlock destination and source buffer */
    GfxUnlockSurface( aDstHandle, 0, 0, 0, 0, 0, 0, 0, 1, 0 );
    GfxUnlockSurface( aSrcHandle, 0, 0, 0, 0, 0, 0, 0, 0, 0 );
  }

  /* otherwise use the hardware... */
  else

#endif
  {
    uint32_t dstColorFormat = kPXP_OutputPixelFormatARGB8888;
    uint32_t srcColorFormat = kPXP_AsPixelFormatARGB8888;
    uint32_t color          = ( EW_ALPHA( aColors[0]) << 24 )
                            | ( EW_RED  ( aColors[0]) << 16 )
                            | ( EW_GREEN( aColors[0]) <<  8 )
                            |   EW_BLUE ( aColors[0]);

    /* prepare access to the destination and source buffer */
    GfxSelectSurfaces( aDstHandle, aSrcHandle );

    /* get the start address in the source and destination and their offsets */
    dst      = (void*)((unsigned char*)dstSurface->Pixel + (( aDstY * dstSurface->Width ) + aDstX ) * dstSurface->BytesPerPixel );
    dstPitch = dstSurface->Width * dstSurface->BytesPerPixel;
    src      = (void*)((unsigned char*)srcSurface->Pixel + (( aSrcY * srcSurface->Width ) + aSrcX ) * srcSurface->BytesPerPixel );
    srcPitch = srcSurface->Width * srcSurface->BytesPerPixel;

    /* change the destination color format, if necessary */
    if ( dstFormat == EW_PIXEL_FORMAT_SCREEN )
      dstColorFormat = kPXP_OutputPixelFormatRGB888P;

    /* change the source color format, if necessary */
    if ( srcFormat == EW_PIXEL_FORMAT_RGB565 )
      srcColorFormat =  kPXP_AsPixelFormatRGB565;

    /* choose the appropriate PXP drawing operation */
    EwBspGraphicsCopy( (uint32_t)dst, (uint32_t)src, dstPitch, srcPitch, aWidth, aHeight, dstColorFormat, srcColorFormat, color );
  }
}


/*******************************************************************************
* FUNCTION:
*   GfxUseGraphicsAccelerator
*
* DESCRIPTION:
*   The function GfxUseGraphicsAccelerator can be used to switch on/off the usage
*   of the graphics accelerator dynamically during runtime. If it is deactivated,
*   the software pixel driver of the Graphics Engine are used to execute the
*   different drawing operations.
*
* ARGUMENTS:
*   aActive     - Flag to control the usage of the graphics accelerator.
*
* RETURN VALUE:
*   None
*
*******************************************************************************/
void GfxUseGraphicsAccelerator( int aActive )
{
  /* check for any changes */
  if ( aActive == UseGraphicsAccelerator )
    return;

  #ifndef EW_DONT_USE_GFX_EMULATION

    /* just store the flag */
    UseGraphicsAccelerator = aActive;

    /* and put a message to the terminal */
    if ( aActive )
      EwPrint( "Graphics Accelerator is now active...\n" );
    else
      EwPrint( "Graphics Accelerator is now disabled!\n" );

  #else

    EwPrint( "Graphics Accelerator is always active.\n" );

  #endif
}


/*******************************************************************************
* FUNCTION:
*   GfxIsGraphicsAcceleratorUsed
*
* DESCRIPTION:
*   The function GfxIsGraphicsAcceleratorUsed returns a non zero value, if the
*   graphics accelerator hardware is activated.
*
* ARGUMENTS:
*   None
*
* RETURN VALUE:
*   A non zero value, if the graphics accelerator hardware is activated.
*
*******************************************************************************/
int GfxIsGraphicsAcceleratorUsed( void )
{
  return UseGraphicsAccelerator;
}

#endif /* EW_USE_GRAPHICS_ACCELERATOR */

/* msy */
